#+title: Docker Image for StarPU data analysis
#+author: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+infojs_opt:
#+property: cache yes

This repository is dedicated to the development of an automated script that
launches the =starvz= analysis script of trace files using a package-ready
Docker image.

** Usage

This repository consists of two main things:

- A Dockerfile containing a StarPU data-analysis-ready environment;
- A executable-like script that runs the =starvz= analysis in a given folder.

To run any of those please follow the instructions given in [[Installation]].

Having that said, you can run some data analysis by using the script called
=starvz=, which is in the root of this repository.

#+begin_src bash :tangle yes
./starvz [options] <full_path_to_the_traces>
#+end_src

By running this command you'll launch the first phase of =starvz='s analysis.

The possible options are as follows:

#+begin_src bash :results output :exports results
./starvz -h
#+end_src

#+RESULTS:
#+begin_example
USAGE:

COMMAND:
  ./starvz [OPTIONS] <DIRECTORY>

  WHERE <DIRECTORY> is the *full* path to the directory containing the fxt traces

  WHERE [OPTIONS] can be any of the following, in no particular order:
    -h | --help
      shows this message and exits
    -i | --image=image_name:tag
      use a remote image instead of the default hcpsilva/starvz:latest
    -t | --tarball=path/to/the/image.tar.gz
      use an image tarball instead of the default hcpsilva/starvz:latest
#+end_example

